Revit 2024 API
PanelScheduleData.GetNumberOfCircuitRows Method
 Gets the number of rows in the circuit table
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public int GetNumberOfCircuitRows()
Visual Basic
Public Function GetNumberOfCircuitRows As Integer
Visual C++
public:
int GetNumberOfCircuitRows()
Return Value
 The number of rows
See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace